In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('c:/dataset/analysis/clothes.txt')
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   small     11     monte
4  medium     10  cantabil
5  medium     10       cob

In [4]:
from sqlalchemy import create_engine
#create_engine is a function(similar to connect() that rerurns connection)

In [6]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\aditya\anaconda3\lib\site-packages (0.9.3)
Note: you may need to restart the kernel to use updated packages.

In [7]:
dbcon=create_engine("mysql+pymysql://root:root@localhost/2to330")

In [8]:
df.to_sql("mycloths",con=dbcon)

In [11]:
dbcon=create_engine("mysql+pymysql://root:root@localhost/130to330")
pd.read_sql("select roll,name from students",con=dbcon)
pd.read_sql("select * from students",con=dbcon)

   roll    name  marks
0   103  chintu    720
1   104   pintu    660
2   201   virat    888
3   202    viru    798
4   203   rahul    898
5   301     abc    999
6   302     pqr    789
7   503    viru    788

In [12]:
pd.read_json('c:/dataset/analysis/students.json')

     name  age  roll
0    sonu   20   101
1    monu   21   102
2  chintu   10   103
3   pintu   25   104

In [14]:
df=pd.read_csv('c:/dataset/analysis/titanic.csv')
df.shape

(891, 12)

In [18]:
df.Survived.unique()

array([0, 1], dtype=int64)

In [20]:
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [26]:
df[df.gender=='male'].shape
df[df.gender=='female'].shape

(314, 12)

In [28]:
df.gender.unique()
df.gender.value_counts()

male      577
female    314
Name: gender, dtype: int64

In [30]:
df[(df.Survived==1) & (df.gender=='male')].shape

(109, 12)

In [31]:
df[(df.Survived==1) & (df.gender=='female')].shape

(233, 12)

In [34]:
df[(df.SibSp==0) & (df.Parch==0) & (df.gender=='male')].shape

(411, 12)

In [35]:
df[(df.SibSp==0) & (df.Parch==0) & (df.gender=='male') & df.Survived==1].shape

(64, 12)

In [39]:
df.sort_values('Fare',ascending=False).head(5)

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S